In [1]:
import pandas as pd

In [2]:
names= pd.Series(['amin','ali','reza'])
names

0    amin
1     ali
2    reza
dtype: object

In [5]:
animals=[2.0,20.1,None]
p_animals=pd.Series(animals)
p_animals

0     2.0
1    20.1
2     NaN
dtype: float64

In [18]:
boolean_sample=[True,False,True,0,None]
p_boolean_sample=pd.Series(boolean_sample,dtype=bool)
p_boolean_sample

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [24]:
animals={
    'n1':'Tiger',
    'n2':'Bear',
    'n3':None
}
p_animals=pd.Series(animals)
p_animals.loc['n2']

'Bear'

In [33]:
p_animals.iloc[1]

'Bear'

In [42]:
import numpy as np
animals2=[2.0,20.1,123]
p_animals2=pd.Series(animals2)
np.sum(p_animals2)

145.1

In [45]:
df = pd.DataFrame([p_animals,p_animals2],index=['first','second'])
df

          0     1      2
first   2.0  20.1    NaN
second  2.0  20.1  123.0

In [52]:
df.iloc[1]
df.loc['first']
df.T

   first  second
0    2.0     2.0
1   20.1    20.1
2    NaN   123.0

In [56]:
np_animals= np.array([[[1,2,3],[3,2,1],[4,6,5]]])
np_animals.T

array([[[1],
        [3],
        [4]],

       [[2],
        [2],
        [6]],

       [[3],
        [1],
        [5]]])

In [64]:
df[1]
df[[1]]

           1
first   20.1
second  20.1

In [81]:
df2=df.copy()
df2= df2.add(pd.DataFrame([pd.Series({'n1':123,'n1':23,'n0':23}),pd.Series({'n2':2123.2,'n0':21.1231})],index=['third','forth']))
df2

         0   1   2  n0  n1  n2
first  NaN NaN NaN NaN NaN NaN
forth  NaN NaN NaN NaN NaN NaN
second NaN NaN NaN NaN NaN NaN
third  NaN NaN NaN NaN NaN NaN

In [83]:
df[1]>10

first     True
second    True
Name: 1, dtype: bool

In [85]:
df['Multiple']=df[0] * df[1]
df.head()

          0     1      2   SUM  Multiple
first   2.0  20.1    NaN  40.2      40.2
second  2.0  20.1  123.0  40.2      40.2